<template><div><h1 id="运算符" tabindex="-1"><a class="header-anchor" href="#运算符" aria-hidden="true">#</a> 运算符</h1>
<p><strong>表达式类型的自动提升</strong></p>
<p>当一个算术表达式中包含多个基本类型的值时，整个算术表达式的数据类型将发生自动提升。Java定义了如下的自动提升规则。</p>
<p><strong><code v-pre>byte、short、char</code>混合运算</strong></p>
<p><code v-pre>byte、short、char</code>做混合运算的时候，各自先转换成int再运算。</p>
<p><strong>多种数据类型做混合运算</strong></p>
<p>多种数据在做混合运算的时候，最终的结果是类型“最大容量”对应的类型（<code v-pre>byte+short+char</code> 例外）。</p>
<h2 id="算术运算符" tabindex="-1"><a class="header-anchor" href="#算术运算符" aria-hidden="true">#</a> 算术运算符</h2>
<p>算术运算符用在数学表达式中，它们的作用和在数学中的作用一样。</p>
<p>下表列出了所有的算术运算符。假设整数变量A的值为10，变量B的值为20：</p>
<table>
<thead>
<tr>
<th>+</th>
<th>加法 - 相加运算符两侧的值</th>
<th>A + B = 30</th>
</tr>
</thead>
<tbody>
<tr>
<td>-</td>
<td>减法 - 左操作数减去右操作数</td>
<td>A – B = 10</td>
</tr>
<tr>
<td>*</td>
<td>乘法 - 相乘操作符两侧的值</td>
<td>A * B = 200</td>
</tr>
<tr>
<td>/</td>
<td>除法 - 左操作数除以右操作数</td>
<td>B / A = 2</td>
</tr>
<tr>
<td>％</td>
<td>取模 - 左操作数除以右操作数的余数</td>
<td>B % A = 0</td>
</tr>
<tr>
<td>++</td>
<td>自增 - 操作数的值增加1</td>
<td>B++ 或 ++B = 21</td>
</tr>
<tr>
<td>--</td>
<td>自减 - 操作数的值减少1</td>
<td>B-- 或 --B = 19</td>
</tr>
</tbody>
</table>
<p><strong>“+”</strong></p>
<p>加法运算、字符串连接运算、自增自减运算符</p>
<p>++出现在变量后，先赋值再自加</p>
<p>++出现在变量前，先自加再赋值</p>
<h2 id="关系运算符" tabindex="-1"><a class="header-anchor" href="#关系运算符" aria-hidden="true">#</a> 关系运算符</h2>
<p>假设整数变量A的值为10，变量B的值为20：</p>
<p>==：检查如果两个操作数的值是否相等，如果相等则条件为真。（A == B）为假(非真)</p>
<p>!=：检查如果两个操作数的值是否相等，如果值不相等则条件为真。	(A != B) 为真</p>
<p>&gt;：检查左操作数的值是否大于右操作数的值，如果是那么条件为真。	（A&gt; B）非真</p>
<p>&lt;：检查左操作数的值是否小于右操作数的值，如果是那么条件为真。	（A &lt;B）为真</p>
<p>=：检查左操作数的值是否大于或等于右操作数的值，如果是那么条件为真。	（A&gt; = B）为假</p>
<p>&lt;=：检查左操作数的值是否小于或等于右操作数的值，如果是那么条件为真。	（A &lt;= B）为真</p>
<h2 id="位运算符" tabindex="-1"><a class="header-anchor" href="#位运算符" aria-hidden="true">#</a> 位运算符</h2>
<p>Java定义了位运算符，应用于整数类型<code v-pre>int</code>、长整型<code v-pre>long</code>、短整型<code v-pre>short</code>、字符型<code v-pre>char</code>和字节型<code v-pre>byte</code>等类型。</p>
<p>位运算符作用在所有的位上，并且按位运算。</p>
<p>假设整数变量 A 的值为 60 和变量 B 的值为 13：</p>
<p>＆：如果相对应位都是1，则结果为1，否则为0（A＆B）得到12，即0000 1100</p>
<p>|：如果相对应位都是 0，则结果为 0，否则为 1（A | B）得到61，即 0011 1101</p>
<p>^：如果相对应位值相同，则结果为0，否则为1（A ^ B）得到49，即 0011 0001</p>
<p>〜：按位取反运算符翻转操作数的每一位，即0变成1，1变成0。（〜A）得到-61，即1100 0011</p>
<p>&lt;&lt;：按位左移运算符。左操作数按位左移右操作数指定的位数。（A &lt;&lt; 2）得到240，即 1111 0000</p>
<p>&gt;&gt;：位右移运算符。左操作数按位右移右操作数指定的位数。（A &gt;&gt; 2）得到15，即 1111</p>
<p>&gt;&gt;&gt;：按位右移补零操作符。左操作数的值按右操作数指定的位数右移，移动得到的空位以零填充。（A&gt;&gt;&gt;2）得到15，即0000 1111</p>
<p>实例代码</p>
<p>Test.java</p>
<h2 id="逻辑运算符" tabindex="-1"><a class="header-anchor" href="#逻辑运算符" aria-hidden="true">#</a> 逻辑运算符</h2>
<p>逻辑运算符要求两边的算子都是布尔类型，并且逻辑运算符最终的运算结果也是一个布尔类型</p>
<p>短路逻辑判断运算符</p>
<p>假设布尔变量A为真，变量B为假</p>
<p>&amp;&amp;	称为逻辑与运算符。当且仅当两个操作数都为真，条件才为真。	（A &amp;&amp; B）为假。</p>
<p>| |	称为逻辑或操作符。如果任何两个操作数任何一个为真，条件为真。	（A | | B）为真。</p>
<p>！	称为逻辑非运算符。用来反转操作数的逻辑状态。如果条件为true，则逻辑非运算符将得到false。	！（A &amp;&amp; B）为真。</p>
<p>逻辑判断运算符</p>
<p>&amp;	逻辑与</p>
<p>|  	逻辑或</p>
<p>！	逻辑非</p>
<p>短路判断与逻辑判断的区别</p>
<p>逻辑判断全部走一遍</p>
<p>短路判断有结果就停</p>
<p>第一个表达式执行结果为true，会发生短路或</p>
<p>第一个表达式执行结果为false，会发生短路与</p>
<p>实例代码</p>
<p>Test02.java</p>
<h2 id="赋值运算符" tabindex="-1"><a class="header-anchor" href="#赋值运算符" aria-hidden="true">#</a> 赋值运算符</h2>
<p>不会改变运算结果类型</p>
<p>例如: x += 1等同于x=(x的数据类型)(x + 1)</p>
<p>=	简单的赋值运算符，将右操作数的值赋给左侧操作数	C = A + B将把A + B得到的值赋给C</p>
<p>=	加和赋值操作符，它把左操作数和右操作数相加赋值给左操作数	C + = A等价于C = C(C的数据类型) + A</p>
<p>=	减和赋值操作符，它把左操作数和右操作数相减赋值给左操作数	C - = A等价于C = C(C的数据类型) - A</p>
<p>=	乘和赋值操作符，它把左操作数和右操作数相乘赋值给左操作数	C * = A等价于C = C(C的数据类型) * A</p>
<p>/ =	除和赋值操作符，它把左操作数和右操作数相除赋值给左操作数	C / = A，C 与 A 同类型时等价于 C = C(C的数据类型) / A</p>
<p>(％)=	取模和赋值操作符，它把左操作数和右操作数取模后赋值给左操作数	C％= A等价于C = C(C的数据类型) ％ A</p>
<p>&lt;&lt; =	左移位赋值运算符	C &lt;&lt; = 2等价于C = C &lt;&lt; 2</p>
<p>=	右移位赋值运算符	C &gt;&gt; = 2等价于C = C &gt;&gt; 2</p>
<p>＆=	按位与赋值运算符	C＆= 2等价于C = C(C的数据类型)＆2</p>
<p>^ =	按位异或赋值操作符	C ^ = 2等价于C = C(C的数据类型) ^ 2</p>
<p>| =	按位或赋值操作符	C | = 2等价于C = C(C的数据类型) | 2</p>
<h2 id="三目运算符" tabindex="-1"><a class="header-anchor" href="#三目运算符" aria-hidden="true">#</a> 三目运算符</h2>
<p>语法格式:</p>
<p>布尔表达式 ? 表达式1 : 表达式2</p>
<p>执行原理:</p>
<p>如果布尔表达式结果为true,则执行表达式1</p>
<p>如果布尔表达式结果为false,则执行表达式2</p>
<p>boolean sex = false;</p>
<p>char c = sex ？'男':'女';</p>
<p>System.out.println(sex);</p>
<p>输出结果为女</p>
<h2 id="instanceof-运算符" tabindex="-1"><a class="header-anchor" href="#instanceof-运算符" aria-hidden="true">#</a> instanceof 运算符</h2>
<p>该运算符用于操作对象实例，检查该对象是否是一个特定类型（类类型或接口类型）。</p>
<p>instanceof运算符使用格式：</p>
<p>(引用 instanceof 类型)</p>
<p>instanceof运算符的2运算结果只能是:true/false</p>
<p>instanceof可以在运行阶段动态判断引用指向的对象的类型</p>
<p>c是一个引用,c变量保存了内存地址指向堆中的对象</p>
<p>假设:(c instanceof Cat)为true表示:</p>
<p>c引用指向的堆内存中的java对象是一个Cat</p>
<p>假设(c instanceof Cat)为false表示:</p>
<p>c引用指向的堆内存中的java对象不是一个Cat</p>
<p>在任何时候对类型进行向下转型时都使用instanceof进行判断(java规范)</p>
<p>实例</p>
<p>Test03.java</p>
<p>控制语句</p>
<p>​	选择语句:</p>
<p>也叫分支语句</p>
<p>​		if语句</p>
<p>​			在任何情况下只能有一个分支执行,不可能存在2个或者多个分支执行,if语句中只要有1个分支执行,整个if语句就结束了
​			else必须跟if
​		switch语句
​			switch语句执行原理：
​				switch后面的小括号当中的“数据”和case后面的“数据”进行一一匹配，匹配成功分支执行。按照顺序结构依次匹配
匹配成功的分支执行，分支当中最后有“break”语句的话，整个switch语句中止。
如果没有“break”语句，直接进入下一个分支执行，不进行匹配（case穿透）
当所有分支都匹配失败，此时如果有default,则执行default语句
switch和case后面只能是int或者String类型的数据,不能是变量,可以是枚举类型
​				byte，short，char写进去会自动转换成int
​			一个比较完整的switch语句编写
switch（int或String类型的字面值或变量）{
case int或String类型的字面值或变量：
​         java语句；
······
break；
case int或String类型的字面值或变量：
​         java语句；
······
break；
······
default：
​    java语句；
······
}
​				case合并
int i = 1；
switch（i）{
case 1：case 2：case 3；
​     System.out.println(???);
}
i可以等于1/2/3
​			无break会出现case穿透现象
​	循环语句:
​		for循环
​			for语句语法结构
for（初始化表达式；布尔表达式；更新表达式）{
循环体
}
​				循环体内定义的变量在main方法中是无法访问的，出了循环体就释放内存
main方法中定义的&quot;i&quot;变量只要main方法没有结束就可以用
​			for循环执行原理
​				初始化表达式、布尔表达式、更新表达式都不是必须的！两个分号是必须的
初始化表达式最先执行，且只执行一次
判断布尔表达式结果是true还是false
true:
执行循环体
执行更新表达式
false:
结束for循环
​		while循环
​			while（布尔表达式）{
循环体：
}
​			while循环执行原理
​				判断布尔表达式
true:
执行循环体</p>
<p>判断布尔表达式
false:
循环结束
do...while...循环
do…while循环和while循环相似
不同的是,即使不满足条件,do…while循环至少会执行一次。
转向语句
break语句
break是java语言中的关键字，被翻译为“中断/折断”
break语句可以使用在switch语句中用来终止switch语句
也可以使用在循环语句中终止循环的执行
break默认情况下中断最近的循环
小插曲，给for循环起名,break不通常的情况
for1:for()
for2:for()
break for1;
continue语句
continue表示：继续/go on/下一个
主要出现在循环语句中控制循环的执行
break表示循环不执行，continue表示跳过本次循环,下一次循环继续执行
return语句
带有return关键字的java语句只要执行，当前方法立即终止
在“同一个作用域”当中，return语句下面不能编写任何代码，因为这些代码永远都执行不到，编译报错。
所有控制语句都可以互相嵌套</p>
<p>方法
什么是方法？
方法就是一段代码片段，并且这段代码片段可以完成某个特定的功能，可以被重复使用
方法定义在类体当中，一个类当中可以定义多个方法，方法编写的位置没有先后顺序，可以随意。
方法体中不能再定义方法！
方法体当中的代码遵守自上而下的顺序依次执行
方法的定义
语法结构：
[修饰符列表] 返回值类型 方法名(形式参数列表){
方法体;
}
修饰符列表：可选项，不必须。
返回值类型
什么是返回值
一个方法是可以完成某个特定功能的，这个功能结束之后大多数都是需要返回最终执行结果的，执行结果可能是一个具体存在的数据，而这个具体存在的数据就是返回值。
返回值是一个具体存在的数据，数据都是有类型的，此处需要指定的是返回值的具体类型
返回值类型都可以指定哪些类型呢？
java任意一种类型都可以，包括基本数据类型和所有的引用数据类型
也可能这个方法执行结束后不返回任何数据，java中规定，当一个方法执行结束后不返回任何数据的话，返回值类型位置必须编写void关键字
返回值类型若不是void，表示这个方法执行结束后必须返回一个具体的数值，当方法执行结束后没有返回任何数据则编译器报错，如何返回数值？--&gt;“return 值”，并要求“值”的数据类型必须和“方法的返回值类型”一致。不然编译器报错。
返回值类型是void的时候，在方法体当中不能编写“return 值；”但可以编写“return”
只要带有return关键字的语句执行，return语句所在的方法就结束
返回值类型不是void的时候
要求方法必须百分百执行“return 值；”这样的语句来完成值的返回。没有这个语句编译器会报错。
一个方法有返回值的时候，当我们调用这个方法的时候，方法返回了一个值，大部分情况下我们都是选择接收的。
深入return语句
带有return关键字的java语句只要执行，当前方法立即终止
在“同一个作用域”当中，return语句下面不能编写任何代码，因为这些代码永远都执行不到，编译报错。
方法名
合法标识符
最好见名知意
最好是动词
首字母小写，后面每个单词首字母大写
参数
形式参数列表：形参
形参是局部变量
个数可以是0~n个
多个形参之间用“，”隔开
形参起决定性作用的是形参的数据类型，形参的名字就是局部变量的名字。
方法在调用的时候，实际给这个方法传递的真实数据为实际参数，简称实参
实参列表和形参列表必须满足：
数量相同
类型对应相同
方法体
方法体必须由大括号括起来，方法体当中的代码有顺序，遵循自上而下·的顺序依次执行，并且方法体由java语句构成，每一个java语句以“；”结尾
方法怎么调用？
方法只定义不去调用时不会执行
语法规则：【方法的修饰符列表当中有static】
类名.方法名（实参列表）；这是一条java语句
有时候“类名”可以省略不写，“类名”省略之后，默认从当前类中找“类名”方法
JVM内存结构
方法在执行过程当中，在JVM中的内存是如何分配的？内存如何变化？
方法只定义不调用，不会执行，并且在JVM中也不会给该方法分配“运行所属”的内存空间。只有在调用这个方法的时候，才会动态的给这个方法分配所属的内存空间。
在JVM内存划分上有这样三块主要的内存空间：
方法区内存
堆内存
栈内存</p>
<pre><code>					▪ 关于“栈”数据结构：
</code></pre>
<p>▪ 栈：stack，是一种数据结构
▪ 数据结构反应的是数据的储存形态
▪ 数据结构是独立的学科，不属于任何编程语言的范畴，但在大多数编程语言当中要使
用数据结构。
▪ 常见的数据结构：</p>
<ul>
<li>
<p>数组</p>
</li>
<li>
<p>队列</p>
</li>
<li>
<p>栈</p>
</li>
<li>
<p>链表</p>
</li>
<li>
<p>二叉树</p>
</li>
<li>
<p>哈希表/散列表</p>
</li>
<li>
<p>······</p>
<pre><code>  		▪ 方法代码片段存在哪里？方法执行的时候执行过程的内存在哪里分配？
</code></pre>
</li>
<li>
<p>方法代码片段属于.class字节码文件的一部分，字节码文件在加载的时候，将其放到了方法区当中。所以JVM中的三块主要当前内存空间中方法区内存最先有数据。存放了代码片段。</p>
</li>
<li>
<p>代码片段虽然在方法区内存当中只有一份，但是可以被重复调用。每一次调用这个方法的时候，需要给该方法分配独立的活动场所,在栈内存中分配。【栈内存中分配方法运行的所属内存空间】</p>
</li>
<li>
<p>方法在调用的时候，会给该方法分配独立的内存空间，在栈中分配，此时发生压栈动作，方法结束后，给该方法分配的内存空间全部释放，此时发生弹栈动作。</p>
<p>重点：方法调用的时候，在参数传递的时候，实际上传递的是变量中保存的那个“值”传过去了。
方法重载
方法重载又被称为：overload
什么时候考虑使用方法重载?</p>
</li>
<li>
<p>功能相似的时候</p>
<p>什么条件满足之后构成了方法重载？</p>
</li>
<li>
<p>在同一个类当中</p>
</li>
<li>
<p>方法名相同
参数列表不同：</p>
</li>
<li>
<p>数量不同</p>
</li>
<li>
<p>顺序不同</p>
</li>
<li>
<p>类型不同</p>
<p>方法重载和什么有关系？
与方法名+参数列表有关
与返回值类型无关
与修饰符列表无关
方法递归
什么是递归？
方法自身调用自身
递归非常的消耗内存，能不用就别用
递归必须有结束条件，没有结束条件一定会发生栈内存溢出错误
如果递归太深了，即使有结束条件，也可能发生栈内存溢出</p>
</li>
</ul>
</div></template>
